# vim: expandtab filetype=ruby

# To bootstrap development, run following commands.
# brew bundle

# Environments
brew 'z'
brew 'fzf'
brew 'the_silver_searcher'
brew 'tmux'

# Utils
brew 'coreutils'
brew 'ctags'
brew 'readline'
brew 'tree'
brew 'hr'
brew 'direnv'
brew 'pngquant'
brew 'pigz'
brew 'htop'
brew 'terminal-notifier'
brew 'yarn'
brew 'jq'
brew 'envchain'

# SCM
brew 'git'
brew 'git-now'
brew 'hub'
brew 'tig'
brew 'gnupg'
brew 'pinentry-mac'

# Languages
brew 'pyenv'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'nodebrew'

# Infra
brew 'awscli'
brew 'amazon-ecs-cli'
brew 'terraform'

# EDITOR
brew 'neovim'

# CASK
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'dash'
cask 'docker'
cask 'keyboard-cleaner'
cask 'karabiner-elements'
cask 'appcleaner'
cask 'vagrant'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'sequel-pro'
