# vim: expandtab filetype=ruby

# To bootstrap development, run following commands.
# brew bundle

# Environments
brew 'bat'
brew 'fd'
brew 'fzf'
brew 'grpcurl'
brew 'ripgrep'
brew 'tmux'
brew 'z'

# Utils
brew 'coreutils'
brew 'ctags'
brew 'readline'
brew 'tree'
brew 'hr'
brew 'direnv'
brew 'htop'
brew 'terminal-notifier'
brew 'yarn'
brew 'jq'
brew 'envchain'
brew 'exiftool'
brew 'gnu-sed'

# SCM
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'git-now'
brew 'hub'
brew 'tig'

# Languages
brew 'go'
brew 'pyenv'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'nodenv'

# Infra
brew 'ctop'
brew 'tfenv'
brew 'terraform-ls'

# EDITOR
brew 'neovim', args: ['HEAD']

# CASK
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'docker'
cask 'keyboard-cleaner'
cask 'karabiner-elements'
cask 'appcleaner'
cask 'google-chrome'
cask 'ghostty'
cask 'slack'
cask 'visual-studio-code'
