# vim: expandtab filetype=ruby

# To bootstrap development, run following commands.
# brew bundle

# Environments
brew 'bat'
brew 'fd'
brew 'fzf'
brew 'grpcurl'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'tmux'
brew 'z'

# Utils
brew 'coreutils'
brew 'ctags'
brew 'readline'
brew 'tree'
brew 'hr'
brew 'direnv'
brew 'pngquant'
brew 'pigz'
brew 'htop'
brew 'terminal-notifier'
brew 'yarn'
brew 'jq'
brew 'envchain'
brew 'mutagen-io/mutagen/mutagen'
brew 'exiftool'
brew 'gnu-sed'

# SCM
brew 'gh'
brew 'git'
brew 'git-now'
brew 'git-when-merged'
brew 'hub'
brew 'tig'
brew 'gpg'
brew 'pinentry-mac'

# Languages
brew 'go'
brew 'pyenv'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'nodebrew'

# Infra
brew 'ctop'
brew 'tfenv'
brew 'terraform-ls'

# EDITOR
brew 'luajit', args: ['HEAD']
brew 'neovim', args: ['HEAD']

# CASK
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'dash'
cask 'docker'
cask 'keyboard-cleaner'
cask 'karabiner-elements'
cask 'appcleaner'
cask 'vagrant'
cask 'virtualbox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'session-manager-plugin'
cask 'sequel-pro'
cask 'postico'
